import pandas as pd
data_dict = {
    "Борисов": {
        "ФИО": "Андрей Валерьевич",
        "Номер ТС": "т624рх797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Бритов": {
        "ФИО": "Данил Анатольевич",
        "Номер ТС": "т134ра797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Бычков": {
        "ФИО": "Дмитрий Александрович",
        "Номер ТС": "к772ор797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Герасимов": {
        "ФИО": "Денис Алексеевич",
        "Номер ТС": "в973ос797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "
    },
    "Деревянко": {
        "ФИО": "Ярослав Сергеевич",
        "Номер ТС": "т892рс797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Дубок": {
        "ФИО": "Иван Григорьевич",
        "Номер ТС": "т650ом797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Жилка 102": {
        "ФИО": " Евгений Викторович",
        "Номер ТС": "т102ра797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Жилка 072": {
        "ФИО": " Евгений Викторович",
        "Номер ТС": "т072ов797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Замошников": {
        "ФИО": " Алексей Михайлович",
        "Номер ТС": "р490он797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Захаровский": {
        "ФИО": " Евгений Сергеевич",
        "Номер ТС": "у889рн797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Кармишин": {
        "ФИО": "Кармишин Андрей Олегович",
        "Номер ТС": "х551ра797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Кулейкин 102": {
        "ФИО": " Станислав Евгеньевич",
        "Номер ТС": "т102ра797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Кулейкин 072": {
        "ФИО": "Кулейкин Станислав Евгеньевич",
        "Номер ТС": "т072ов797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Масленков": {
        "ФИО": "Масленков Алексей Владимирович",
        "Номер ТС": "о221оу797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Мочалов": {
        "ФИО": "Мочалов Владимир Владимирович",
        "Номер ТС": "н741оа797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Островерхов": {
        "ФИО": "Островерхов Игорь Анатолиевич",
        "Номер ТС": "р411оа797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Петухов": {
        "ФИО": "Петухов Сергей Викторович",
        "Номер ТС": "о196оу797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    "Примкулов": {
        "ФИО": "Примкулов Улан Кадырбекович",
        "Номер ТС": "н779оа797",
        "Телефон": "",
        "Паспортные данные": "",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": ""
    },
    
}




def get_data_by_surname(surname):
    try:
        # Проверяем, является ли значение пустым или NaN
        if pd.isna(surname):
            print(f"Пустое значение: {surname}")
            return {"ФИО": "Данные не найдены"}

        # Преобразуем surname в строку и убираем лишние пробелы
        surname = str(surname).strip()

        # Если фамилия содержит число (например, "Жилка 102"), разделяем её
        parts = surname.split()
        if len(parts) > 1 and parts[-1].isdigit():
            # Формируем ключ: "Фамилия Номер" (например, "Жилка 102")
            key = " ".join(parts)
            print(f"Поиск по ключу: {key}")
            return data_dict.get(key, {"ФИО": "Данные не найдены"})
        else:
            # Если нет числа, ищем только по фамилии
            print(f"Поиск по фамилии: {surname}")
            return data_dict.get(surname, {"ФИО": "Данные не найдены"})

    except Exception as e:
        print(f"Ошибка при поиске данных: {e}")
        return {"ФИО": "Ошибка при поиске данных"}