import pandas as pd
data_dict = {
    "Борисов": {
        "ФИО": "Борисов Андрей Валерьевич",
        "Номер ТС": "т624рх797",
        "Телефон": "89262821096",
        "Паспортные данные": "4607 153523",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "9907 359972"
    },
    "Бритов": {
        "ФИО": "Бритов Данил Анатольевич",
        "Номер ТС": "т134ра797",
        "Телефон": "89011864788",
        "Паспортные данные": "4607 589902",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "5022 900385"
    },
    "Бычков": {
        "ФИО": "Бычков Дмитрий Александрович",
        "Номер ТС": "к772ор797",
        "Телефон": "89779874732",
        "Паспортные данные": "6304 285874",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "6415 102741"
    },
    "Герасимов": {
        "ФИО": "Герасимов Денис Алексеевич",
        "Номер ТС": "в973ос797",
        "Телефон": "89688800965",
        "Паспортные данные": "1721 797768",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9932 851894"
    },
    "Деревянко": {
        "ФИО": "Деревянко Ярослав Сергеевич",
        "Номер ТС": "т892рс797",
        "Телефон": "89267646966",
        "Паспортные данные": "4521 042410",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9937 922111"
    },
    "Дубок": {
        "ФИО": "Дубок Иван Григорьевич",
        "Номер ТС": "т650ом797",
        "Телефон": "89398533606",
        "Паспортные данные": "2016 973709",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "9924 734628"
    },
    "Жилка 102": {
        "ФИО": "Жилка Евгений Викторович",
        "Номер ТС": "т102ра797",
        "Телефон": "89850607006",
        "Паспортные данные": "4518 399596",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9922 893961"
    },
    "Жилка 072": {
        "ФИО": "Жилка Евгений Викторович",
        "Номер ТС": "т072ов797",
        "Телефон": "89850607006",
        "Паспортные данные": "4518 399596",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9922 893961"
    },
    "Замошников": {
        "ФИО": "Замошников Алексей Михайлович",
        "Номер ТС": "р490он797",
        "Телефон": "89684036790",
        "Паспортные данные": "4510 216062",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "7706 825945"
    },
    "Захаровский": {
        "ФИО": "Захаровский Евгений Сергеевич",
        "Номер ТС": "у889рн797",
        "Телефон": "89266941734",
        "Паспортные данные": "4509 700940",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "7735 820221"
    },
    "Кармишин": {
        "ФИО": "Кармишин Андрей Олегович",
        "Номер ТС": "х551ра797",
        "Телефон": "89161223280",
        "Паспортные данные": "4620 745896",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "7736 896058"
    },
    "Кулейкин 102": {
        "ФИО": "Кулейкин Станислав Евгеньевич",
        "Номер ТС": "т102ра797",
        "Телефон": "89165792784",
        "Паспортные данные": "0404 562885",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9913 356917"
    },
    "Кулейкин 072": {
        "ФИО": "Кулейкин Станислав Евгеньевич",
        "Номер ТС": "т072ов797",
        "Телефон": "89165792784",
        "Паспортные данные": "0404 562885",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9913 356917"
    },
    "Масленков": {
        "ФИО": "Масленков Алексей Владимирович",
        "Номер ТС": "о221оу797",
        "Телефон": "89774805097",
        "Паспортные данные": "4514 998258",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "7730 315629"
    },
    "Мочалов": {
        "ФИО": "Мочалов Владимир Владимирович",
        "Номер ТС": "н741оа797",
        "Телефон": "89252810036",
        "Паспортные данные": "4504 094425",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "9902 288361"
    },
    "Островерхов": {
        "ФИО": "Островерхов Игорь Анатолиевич",
        "Номер ТС": "р411оа797",
        "Телефон": "89153471432",
        "Паспортные данные": "4519 007208",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "5028 247431"
    },
    "Петухов": {
        "ФИО": "Петухов Сергей Викторович",
        "Номер ТС": "о196оу797",
        "Телефон": "89263187338",
        "Паспортные данные": "4613 021316",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "5011 466616"
    },
    "Примкулов": {
        "ФИО": "Примкулов Улан Кадырбекович",
        "Номер ТС": "н779оа797",
        "Телефон": "89152316678",
        "Паспортные данные": "4524 313639",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9904 640776"
    },
    "Пронькин": {
        "ФИО": "Пронькин Эдуард Викторович",
        "Номер ТС": "х847ом797",
        "Телефон": "89091618201",
        "Паспортные данные": "8923 626040",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "5022 918008"
    },
    "Прыткин": {
        "ФИО": "Прыткин Максим Вячеславович",
        "Номер ТС": "у889рн797",
        "Телефон": "89850652919",
        "Паспортные данные": "4514 946865",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "7708 358791"
    },
    "Прядка": {
        "ФИО": "Прядка Вадим Иванович",
        "Номер ТС": "р490он797",
        "Телефон": "89093975279",
        "Паспортные данные": "8511 464962",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "9525 074632"
    },
    "Пуцняков": {
        "ФИО": "Пуцняков Савелий Анатольевич ",
        "Номер ТС": "о694от797",
        "Телефон": "89299342797",
        "Паспортные данные": "4523 852659",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "9929 014685"
    },
    "Семенов": {
        "ФИО": "Семенов Антон Владимирович",
        "Номер ТС": "х070ов797",
        "Телефон": "89264794536",
        "Паспортные данные": "4608 272763",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "5029 562351"
    },
    "Толканов": {
        "ФИО": "Толканов Максим Игоревич",
        "Номер ТС": "о743от797",
        "Телефон": "89858777979",
        "Паспортные данные": "4509 962552",
        "Паллетность": 8,
        "Марка ТС": "ГАЗ",
        "В/У": "9935 016610"
    },
    "Федотов 102": {
        "ФИО": "Федотов Сергей Юрьевич",
        "Номер ТС": "т102ра797",
        "Телефон": "89997906121",
        "Паспортные данные": "9713 067725",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9910 251102"
    },
    "Федотов 072": {
        "ФИО": "Федотов Сергей Юрьевич",
        "Номер ТС": "т072ов797",
        "Телефон": "89997906121",
        "Паспортные данные": "9713 067725",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9910 251102"
    },
    "Хасая": {
        "ФИО": "Хасая Роман Гурамович",
        "Номер ТС": "х984оа797",
        "Телефон": "89029029217",
        "Паспортные данные": "4524 013804",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "9931 654398"
    },
    "Расулбек Уулу": {
        "ФИО": "Расулбек Уулу Даниел",
        "Номер ТС": "у889рн797",
        "Телефон": "879998546242",
        "Паспортные данные": "AN4609321",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "DL0637385"
    },
    "Керекеша": {
        "ФИО": "Керекеша Дмитрий Николаевич",
        "Номер ТС": "р967ом797",
        "Телефон": "89773416299",
        "Паспортные данные": "45 07 539 773",
        "Паллетность": 8.0,
        "Марка ТС": "ГАЗ",
        "В/У": "7719 631622"
    }
}




def get_data_by_surname(surname):
    try:
        # Проверяем, является ли значение пустым или NaN
        if pd.isna(surname):
            print(f"Пустое значение: {surname}")
            return {"ФИО": "Данные не найдены"}

        # Преобразуем surname в строку и убираем лишние пробелы
        surname = str(surname).strip()

        # Если фамилия содержит число (например, "Жилка 102"), разделяем её
        parts = surname.split()
        if len(parts) > 1 and parts[-1].isdigit():
            # Формируем ключ: "Фамилия Номер" (например, "Жилка 102")
            key = " ".join(parts)
            print(f"Поиск по ключу: {key}")
            return data_dict.get(key, {"ФИО": "Данные не найдены"})
        else:
            # Если нет числа, ищем только по фамилии
            print(f"Поиск по фамилии: {surname}")
            return data_dict.get(surname, {"ФИО": "Данные не найдены"})

    except Exception as e:
        print(f"Ошибка при поиске данных: {e}")
        return {"ФИО": "Ошибка при поиске данных"}